content/posts-org/interview-notes-ravali.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     Interview with Ravali
#+AUTHOR:    Fei Ni
#+EMAIL:     fei.ni@helix.com
#+DATE:      2021-01-01
#+HUGO_CATEGORIES: helix
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here

* Basic Info

| Candidate Name | Kumar Subramanian    |
| Job Level      | Senior               |
| Type           | Tech phone screening |
| Date           | 06/02/2021           |

Highlight: 
  - 20+ years experience
* timeline
|           Time | activity                                                                                     |
|          16:00 | Interview started                                                                            |
|          16:10 | Switch to coding challenge, had some trouble to open coderpad, that's why it's a little late |
|          16:13 | Start coding                                                                                 |
| 16:30 to 16:37 | Stuck at rule 5                                                                              |
|          16:42 | Start to compile and run before implementing rule 6 and 7                                    |
|          17:09 | Stop the session, still not be able to resolve the compilation error                         |




* General notes
- Start quickly without asking questions
- Deal with each rule one by one, start implementing without having overall understanding of the requirement
- Using functional style Java, but not very familiar with it, Took a long time to resolve syntax error, and failed to resolve it at the end
- Didn't get time to run test with her implementation


* More

#+begin_src sql
SELECT
   s.name AS SampleName,
   c.name AS PlateName,
   cp.wellxposition,
   cp.wellyposition
FROM
   lims_sample s
INNER JOIN lims_artifact_sample_map asm
   ON asm.processid = s.processid
INNER JOIN lims_artifact a
   ON asm.artifactid = a.artifactid
INNER JOIN lims_containerplacement cp
   ON cp.processartifactid = a.artifactid
INNER JOIN lims_container c
   ON (
   c.containerid = cp.containerid
   AND
   c.name LIKE '%-DNA')
Where s.name IN ('SA-62-Plate_1-E03')
#+end_src
